Repository: lewisbar/TrackChart
Catalog: TrackChartiOS/Resources/Localizable.xcstrings
Source language: en
Languages: de

source: Add a new entry
de: Füge einen neuen Eintrag hinzu

source: Add a new topic
de: Füge ein neues Thema hinzu

source: Aggregation Explained
de: Erklärung zur Aggregierung

# Aggregation Explanation Long
source: Entries are aggregated using the selected method to reduce the number of visible data points, making the chart easier to analyze and improving display performance. In both the weekly and monthly views, all entries for a given day are aggregated into a single data point. In the yearly view, all entries for a given month are aggregated into a single data point. For example, if you entered the values 1, 2, and 3 all on the same day and choose the Sum method, that day will have a value of 1 + 2 + 3 = 6. However, if you choose the Average method, it will be (1 + 2 + 3) / 3 = 2, which is the average for that day. Sum makes more sense for data that accumulates, such as push-ups or pages read. For example, if you are tracking how many pages you read and you read 5 pages in the morning, 10 pages in the afternoon, and 15 pages in the evening, it is probably more interesting to know that you read a total of 30 pages that day (Sum) than that the average entry for that day was 10. Average makes more sense for data that does not accumulate, such as body weight. If you weigh 75 kg in week 1, 80 kg in week 2, and 85 kg in week 3, you probably don't want to know that you weighed 240 kg (Sum) that month, but rather that you weighed 80 kg on average.
de: Die Einträge werden anhand der ausgewählten Methode aggregiert (zusammengefasst), um die Anzahl der sichtbaren Datenpunkte zu reduzieren, wodurch das Diagramm leichter zu analysieren ist und die Anzeige-Performance verbessert wird. Sowohl in der Wochen- als auch in der Monatsansicht werden alle Einträge für einen bestimmten Tag zu einem einzigen Datenpunkt aggregiert. In der Jahresansicht werden alle Einträge für einen bestimmten Monat zu einem einzigen Datenpunkt aggregiert. Wenn man z.B. die Werte 1, 2 und 3 alle am selben Tag eingegeben hat und die Methode „Summe” wählt, hat dieser Tag den Wert 1 + 2 + 3 = 6. Wenn man dagegen die Methode „Durchschnitt” wählt, ist der Wert (1 + 2 + 3) / 3 = 2, was dem Durchschnitt für diesen Tag entspricht. Die Summe ist sinnvoller für Daten, die sich akkumulieren (ansammeln/aufaddieren), wie Liegestütze oder gelesene Seiten. Wenn man beispielsweise trackt, wie viele Seiten man liest, und man morgens 5 Seiten, nachmittags 10 Seiten und abends 15 Seiten liest, ist es wahrscheinlich interessanter zu wissen, dass man an diesem Tag insgesamt 30 Seiten gelesen hat (Summe), als dass der durchschnittliche Eintrag für diesen Tag 10 betrug. Der Durchschnitt ist sinnvoller für Daten, die sich nicht ansammeln, wie beispielsweise das Körpergewicht. Wenn man in der 1. Woche 75 kg wiegt, in der 2. Woche 80 kg und in 3. Woche 85 kg, möchte man wahrscheinlich nicht wissen, dass man in diesem Monat insgesamt 240 kg (Summe) gewogen hat, sondern dass man durchschnittlich 80 kg gewogen hat.

# Aggregation Explanation Short
source: Entries are aggregated using the selected method. - Sum makes more sense for data that adds up, like pushups or pages read. - Average makes more sense for data that doesn't add up, like body weight.
de: Die Einträge werden anhand der ausgewählten Methode aggregiert. - Die Summe ist sinnvoller für Daten, die sich aufaddieren, wie Liegestütze oder gelesene Seiten. - Der Durchschnitt ist sinnvoller für Daten, die sich nicht aufaddieren, wie das Körpergewicht.

source: Aggregation method
de: Aggregierungsmethode

source: Automatic Preview
de: Automatische Vorschau

source: Average
de: Durchschnitt

source: Avg %@
de: Ø %@

source: Cancel
de: Abbrechen

source: Change sign
de: Vorzeichen wechseln

source: Color Palette
de: Farbpalette

source: Daily Average
de: Tagesdurchschnitt

source: Daily Sum
de: Tagessumme

source: Date
de: Datum

source: Description
de: Beschreibung

source: Display empty periods as zero
de: Leere Zeiträume als null darstellen

source: Done
de: Fertig

source: Enter a description...
de: Gib eine Beschreibung ein…

# Entries
source: %lld entries
de: %lld Einträge

source: Hide
de: Schließen

# Is selected palette
source: (selected)
de: (ausgewählt)

source: Learn more
de: Mehr erfahren

source: Month
de: Monat

source: Monthly Average
de: Monatsdurchschnitt

source: Monthly Sum
de: Monatssumme

source: No data yet
de: Noch keine Daten

# No entries yet
source: No entries yet. Tap the plus button to add your first entry.
de: Noch keine Einträge. Tippe auf den Plus-Button, um deinen ersten Eintrag hinzuzufügen.

source: Now
de: Jetzt

source: Raw Data
de: Rohe Daten

source: Selected color palette: %@
de: Ausgewählte Farbpalette: %@

source: Selects this color palette for chart rendering
de: Wählt diese Farbpalette für die Chart-Anzeige aus

source: Settings button
de: Einstellungen-Button

source: Submit
de: Speichern

source: Sum
de: Summe

# Tap plus button to add topic
source: Tap the plus button to add a topic. A topic can be anything you want to track, like daily pages read, push-ups, your weight loss progress, or scientific data.
de: Tippe auf den Plus-Button, um ein Thema hinzuzufügen. Ein Thema kann alles sein, was du tracken möchtest, wie z.B. pro Tag gelesene Seiten, Liegestütze, Körpergewicht oder wissenschaftliche Daten.

source: Tap to edit entry
de: Tippen, um Eintrag zu bearbeiten

source: Tap to edit, swipe left to delete.
de: Tippen zum Bearbeiten, nach links wischen zum Löschen.

source: Topic name
de: Name des Themas

source: Topic Settings
de: Thema-Einstellungen

source: Total %@
de: Gesamt %@

source: Value
de: Wert

source: Week
de: Woche

source: Weekly Average
de: Wochendurchschnitt

source: Weekly Sum
de: Wochensumme

source: Year
de: Jahr

source: Yearly Average
de: Jahresdurchschnitt

source: Yearly Sum
de: Jahressumme

# Zero filling explanation short
source: - Enable for data such as pages read. On empty days, you read zero pages. - Disable for data such as body weight. On empty days, you weren't weightless.
de: - Aktiviere für Daten wie gelesene Seiten. An leeren Tagen hast du null Seiten gelesen. - Deaktiviere für Daten wie Körpergewicht. An leeren Tagen warst du nicht schwerelos.
